import React, { useEffect, useState } from "react";
import { PrinterOutlined } from '@ant-design/icons';
import TableDetail from "@/components/table/tableDetail";
import TableUserDetail from '@/components/table/tableUserDetail';
import { Box, Button, Card, Grid2 as Grid, useMediaQuery } from "@mui/material";
import BarCharts from '@/components/chart/barChart'
import BarChartsUser from '../chart/barChartUser';
import YearPicker from "@/components/yearPicker";
import { DownloadRounded } from "@mui/icons-material";
import { useTheme } from "@emotion/react";


const monthlyData = {
    "2566": [
        { name: "ตุลาคม 65", จำนวนผู้ป่วย: 7432, จำนวนแพทย์ผู้ใช้งาน: 1213, จำนวนการเข้ารับบริการ: 7775 },
        { name: "พฤศจิกายน 65", จำนวนผู้ป่วย: 7380, จำนวนแพทย์ผู้ใช้งาน: 1265, จำนวนการเข้ารับบริการ: 7661 },
        { name: "ธันวาคม 65", จำนวนผู้ป่วย: 7326, จำนวนแพทย์ผู้ใช้งาน: 1226, จำนวนการเข้ารับบริการ: 7646 },
        { name: "มกราคม 66", จำนวนผู้ป่วย: 7426, จำนวนแพทย์ผู้ใช้งาน: 1233, จำนวนการเข้ารับบริการ: 7761 },
        { name: "กุมภาพันธ์ 66", จำนวนผู้ป่วย: 7180, จำนวนแพทย์ผู้ใช้งาน: 1204, จำนวนการเข้ารับบริการ: 7481 },
        { name: "มีนาคม 66", จำนวนผู้ป่วย: 7400, จำนวนแพทย์ผู้ใช้งาน: 1185, จำนวนการเข้ารับบริการ: 7732 },
        { name: "เมษายน 66", จำนวนผู้ป่วย: 7191, จำนวนแพทย์ผู้ใช้งาน: 1233, จำนวนการเข้ารับบริการ: 7491 },
        { name: "พฤกษาคม 66", จำนวนผู้ป่วย: 7330, จำนวนแพทย์ผู้ใช้งาน: 1200, จำนวนการเข้ารับบริการ: 7611 },
        { name: "มิถุนายน 66", จำนวนผู้ป่วย: 7328, จำนวนแพทย์ผู้ใช้งาน: 1266, จำนวนการเข้ารับบริการ: 7612 },
        { name: "กรกฎาคม 66", จำนวนผู้ป่วย: 7353, จำนวนแพทย์ผู้ใช้งาน: 1241, จำนวนการเข้ารับบริการ: 7670 },
        { name: "สิงหาคม 66", จำนวนผู้ป่วย: 7334, จำนวนแพทย์ผู้ใช้งาน: 1282, จำนวนการเข้ารับบริการ: 7645 },
        { name: "กันยายน 66", จำนวนผู้ป่วย: 7337, จำนวนแพทย์ผู้ใช้งาน: 1258, จำนวนการเข้ารับบริการ: 7636 },
    ],
    "2567": [
        { name: "ตุลาคม 66", จำนวนผู้ป่วย: 7343, จำนวนแพทย์ผู้ใช้งาน: 1264, จำนวนการเข้ารับบริการ: 7652 },
        { name: "พฤศจิกายน 66", จำนวนผู้ป่วย: 7297, จำนวนแพทย์ผู้ใช้งาน: 1211, จำนวนการเข้ารับบริการ: 7579 },
        { name: "ธันวาคม 66", จำนวนผู้ป่วย: 7362, จำนวนแพทย์ผู้ใช้งาน: 1250, จำนวนการเข้ารับบริการ: 7670 },
        { name: "มกราคม 67", จำนวนผู้ป่วย: 7414, จำนวนแพทย์ผู้ใช้งาน: 1264, จำนวนการเข้ารับบริการ: 7729 },
        { name: "กุมภาพันธ์ 67", จำนวนผู้ป่วย: 7396, จำนวนแพทย์ผู้ใช้งาน: 1224, จำนวนการเข้ารับบริการ: 7708 },
        { name: "มีนาคม 67", จำนวนผู้ป่วย: 7412, จำนวนแพทย์ผู้ใช้งาน: 1211, จำนวนการเข้ารับบริการ: 7701 },
        { name: "เมษายน 67", จำนวนผู้ป่วย: 7281, จำนวนแพทย์ผู้ใช้งาน: 1231, จำนวนการเข้ารับบริการ: 7586 },
        { name: "พฤกษาคม 67", จำนวนผู้ป่วย: 7422, จำนวนแพทย์ผู้ใช้งาน: 1206, จำนวนการเข้ารับบริการ: 7724 },
        { name: "มิถุนายน 67", จำนวนผู้ป่วย: 7418, จำนวนแพทย์ผู้ใช้งาน: 1226, จำนวนการเข้ารับบริการ: 7711 },
        { name: "กรกฎาคม 67", จำนวนผู้ป่วย: 7446, จำนวนแพทย์ผู้ใช้งาน: 1276, จำนวนการเข้ารับบริการ: 7716 },
        { name: "สิงหาคม 67", จำนวนผู้ป่วย: 7293, จำนวนแพทย์ผู้ใช้งาน: 1210, จำนวนการเข้ารับบริการ: 7596 },
        { name: "กันยายน 67", จำนวนผู้ป่วย: 7356, จำนวนแพทย์ผู้ใช้งาน: 1237, จำนวนการเข้ารับบริการ: 7663 },
    ],
    "2568": [
        { name: "ตุลาคม 67", จำนวนผู้ป่วย: 7311, จำนวนแพทย์ผู้ใช้งาน: 1235, จำนวนการเข้ารับบริการ: 7592 },
        { name: "พฤศจิกายน 67", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "ธันวาคม 67", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "มกราคม 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "กุมภาพันธ์ 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "มีนาคม 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "เมษายน 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "พฤกษาคม 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "มิถุนายน 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "กรกฎาคม 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "สิงหาคม 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "กันยายน 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
    ]
};

const accumulateData = {
    "2566": [
        { name: "ตุลาคม 65", จำนวนผู้ป่วย: 7432, จำนวนแพทย์ผู้ใช้งาน: 1213, จำนวนการเข้ารับบริการ: 7775 },
        { name: "พฤศจิกายน 65", จำนวนผู้ป่วย: 14812, จำนวนแพทย์ผู้ใช้งาน: 2478, จำนวนการเข้ารับบริการ: 15436 },
        { name: "ธันวาคม 65", จำนวนผู้ป่วย: 22138, จำนวนแพทย์ผู้ใช้งาน: 3704, จำนวนการเข้ารับบริการ: 23082 },
        { name: "มกราคม 66", จำนวนผู้ป่วย: 29564, จำนวนแพทย์ผู้ใช้งาน: 4937, จำนวนการเข้ารับบริการ: 30843 },
        { name: "กุมภาพันธ์ 66", จำนวนผู้ป่วย: 36744, จำนวนแพทย์ผู้ใช้งาน: 6141, จำนวนการเข้ารับบริการ: 38324 },
        { name: "มีนาคม 66", จำนวนผู้ป่วย: 44144, จำนวนแพทย์ผู้ใช้งาน: 7326, จำนวนการเข้ารับบริการ: 46056 },
        { name: "เมษายน 66", จำนวนผู้ป่วย: 51335, จำนวนแพทย์ผู้ใช้งาน: 8559, จำนวนการเข้ารับบริการ: 53547 },
        { name: "พฤกษาคม 66", จำนวนผู้ป่วย: 58665, จำนวนแพทย์ผู้ใช้งาน: 9759, จำนวนการเข้ารับบริการ: 61158 },
        { name: "มิถุนายน 66", จำนวนผู้ป่วย: 65993, จำนวนแพทย์ผู้ใช้งาน: 11025, จำนวนการเข้ารับบริการ: 68770 },
        { name: "กรกฎาคม 66", จำนวนผู้ป่วย: 73346, จำนวนแพทย์ผู้ใช้งาน: 12266, จำนวนการเข้ารับบริการ: 76440 },
        { name: "สิงหาคม 66", จำนวนผู้ป่วย: 80680, จำนวนแพทย์ผู้ใช้งาน: 13548, จำนวนการเข้ารับบริการ: 84085 },
        { name: "กันยายน 66", จำนวนผู้ป่วย: 88017, จำนวนแพทย์ผู้ใช้งาน: 14806, จำนวนการเข้ารับบริการ: 91721 },
    ],
    "2567": [
        { name: "ตุลาคม 66", จำนวนผู้ป่วย: 95360, จำนวนแพทย์ผู้ใช้งาน: 16070, จำนวนการเข้ารับบริการ: 99373 },
        { name: "พฤศจิกายน 66", จำนวนผู้ป่วย: 102657, จำนวนแพทย์ผู้ใช้งาน: 17281, จำนวนการเข้ารับบริการ: 106952 },
        { name: "ธันวาคม 66", จำนวนผู้ป่วย: 110019, จำนวนแพทย์ผู้ใช้งาน: 18531, จำนวนการเข้ารับบริการ: 114622 },
        { name: "มกราคม 67", จำนวนผู้ป่วย: 117433, จำนวนแพทย์ผู้ใช้งาน: 19795, จำนวนการเข้ารับบริการ: 122351 },
        { name: "กุมภาพันธ์ 67", จำนวนผู้ป่วย: 124829, จำนวนแพทย์ผู้ใช้งาน: 21019, จำนวนการเข้ารับบริการ: 130059 },
        { name: "มีนาคม 67", จำนวนผู้ป่วย: 132241, จำนวนแพทย์ผู้ใช้งาน: 22230, จำนวนการเข้ารับบริการ: 137760 },
        { name: "เมษายน 67", จำนวนผู้ป่วย: 139522, จำนวนแพทย์ผู้ใช้งาน: 23461, จำนวนการเข้ารับบริการ: 145346 },
        { name: "พฤกษาคม 67", จำนวนผู้ป่วย: 146944, จำนวนแพทย์ผู้ใช้งาน: 24667, จำนวนการเข้ารับบริการ: 153070 },
        { name: "มิถุนายน 67", จำนวนผู้ป่วย: 154362, จำนวนแพทย์ผู้ใช้งาน: 25893, จำนวนการเข้ารับบริการ: 160781 },
        { name: "กรกฎาคม 67", จำนวนผู้ป่วย: 161808, จำนวนแพทย์ผู้ใช้งาน: 27169, จำนวนการเข้ารับบริการ: 168497 },
        { name: "สิงหาคม 67", จำนวนผู้ป่วย: 169101, จำนวนแพทย์ผู้ใช้งาน: 28379, จำนวนการเข้ารับบริการ: 176093 },
        { name: "กันยายน 67", จำนวนผู้ป่วย: 176457, จำนวนแพทย์ผู้ใช้งาน: 29616, จำนวนการเข้ารับบริการ: 183756 },
    ],
    "2568": [
        { name: "ตุลาคม 67", จำนวนผู้ป่วย: 183768, จำนวนแพทย์ผู้ใช้งาน: 30851, จำนวนการเข้ารับบริการ: 191348 },
        { name: "พฤศจิกายน 67", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "ธันวาคม 67", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "มกราคม 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "กุมภาพันธ์ 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "มีนาคม 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "เมษายน 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "พฤกษาคม 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "มิถุนายน 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "กรกฎาคม 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "สิงหาคม 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
        { name: "กันยายน 68", จำนวนผู้ป่วย: 0, จำนวนแพทย์ผู้ใช้งาน: 0, จำนวนการเข้ารับบริการ: 0 },
    ]
};

const PageUser = () => {
    const theme = useTheme();
    const [selectedYear, setSelectedYear] = useState("2568");
    const isMobile = useMediaQuery(theme.breakpoints.down("md"));


    const handleYearChange = (year) => {
        setSelectedYear(year);
    };

    return (
        <div className="p-4">
            <div className="w-full items-center	" >
                <Grid container spacing={2}>
                    <Grid size={{ xs: 12, md: 9 }} className="content-center">
                        <p className="text-sm md:text-lg font-medium ">สถิติการใช้งานทั้งหมด</p>
                    </Grid>
                </Grid>
            </div>

            <Grid container spacing={5} justify="center" style={{ marginTop: 20 }}>
                <Grid size={{ xs: 12, sm: 4, md: 4 }}>
                    <Card className="grid justify-center text-center items-center  min-h-[140px] bg-gray-100 rounded-[16px]">
                        <h2 className="text-main mt-5 px-2">จำนวนการเข้ารับบริการ (ราย)</h2>
                        <p className="text-main sm:text-[28px] md:text-4xl text-3xl	mb-5 ">191,348</p>
                    </Card>
                </Grid>

                <Grid size={{ xs: 12, sm: 4, md: 4 }}>
                    <Card className="grid justify-center text-center items-center min-h-[140px] bg-gray-100 rounded-[16px]">
                        <h2 className="text-main mt-5 px-2">จำนวนผู้ป่วย (ราย)</h2>
                        <p className="text-main sm:text-[28px] md:text-4xl text-3xl	mb-5">183,768</p>
                    </Card>
                </Grid>

                <Grid size={{ xs: 12, sm: 4, md: 4 }}>
                    <Card className="grid justify-center text-center items-center min-h-[140px] bg-gray-100 rounded-[16px]">
                        <h2 className="text-main mt-5 px-2">บุคลากรทางการแพทย์ผู้ใช้งาน (คน)</h2>
                        <p className="text-main sm:text-[28px] md:text-4xl text-3xl	mb-5">30,851</p>
                    </Card>
                </Grid>
            </Grid>

            <div className=" relative border rounded-[6px] mt-8">
                <Grid container spacing={1} alignItems="center" justifyContent="flex-end" className="mt-4">
                    {
                        isMobile ? (
                            <>
                                <Grid size={{ xs: 12, md: 4 }} className="text-end mx-3">
                                    <YearPicker height="40px" onChange={handleYearChange} selectedYear={selectedYear} />
                                </Grid>
                                < Grid size={{ xs: 12, md: 4 }} className="text-end content-center m-[10px]">
                                    <Button className="w-full bg-white border-solid border-2 border-[#23B0BA] rounded-[30px] text-[#333333] rounded-[15px] xl:text-base md:text-sm">
                                        <DownloadRounded className="mr-2" />
                                        ดาวน์โหลด
                                    </Button>
                                </Grid>
                            </>
                        ) : (
                            <Grid size={{ xs: 12, md: 12 }} className="text-end content-center m-[10px]">
                                <div className="flex justify-end items-center">
                                    <YearPicker height="40px" onChange={handleYearChange} selectedYear={selectedYear} />
                                    <Button className="mt-[6px] max-h-[40px] ml-[10px] max-w-[140px] w-full bg-white border-solid border-2 border-[#23B0BA] rounded-[30px] text-[#333333] rounded-[15px] xl:text-base md:text-sm">
                                        <DownloadRounded className="mr-2" />
                                        ดาวน์โหลด
                                    </Button>
                                </div>
                            </Grid>
                        )
                    }

                </Grid>
                <Grid container spacing={2} justify="center" className="mt-3 ml-4">
                    <Grid size={{ xs: 12, sm: 12, md: 12 }}>
                        <p className="text-subText text-lg mb-2">จำนวนรายเดือน</p>
                    </Grid>
                    <Grid size={{ xs: 12, sm: 12, lg: 6 }}>
                        <BarCharts data={monthlyData[selectedYear]} />
                    </Grid>
                    <Grid size={{ xs: 12, sm: 12, lg: 6 }}>
                        <TableDetail data={monthlyData[selectedYear]} />
                    </Grid>
                </Grid>

                <Grid container spacing={2} className='mt-4'>
                    <Grid size={{ xs: 12, sm: 12, md: 12 }}>
                        <p className="text-subText text-lg mg-2 ml-5">จำนวนสะสม</p>
                    </Grid>
                    <Grid size={{ xs: 12, sm: 12, lg: 6 }}>
                        <BarChartsUser data={accumulateData[selectedYear]} />
                    </Grid>
                    <Grid size={{ xs: 12, sm: 12, lg: 6 }}>
                        <TableUserDetail data={accumulateData[selectedYear]} />
                    </Grid>
                </Grid>
            </div>
        </div >)
}

export default PageUser;

